ansible_cucm/cucmv2/roles/CUCM_axl_setup/files/AxlCmds/AXL_addSipProfile.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:ns="http://www.cisco.com/AXL/API/11.5">
   <soapenv:Header/>
   <soapenv:Body>
      <ns:addSipProfile sequence="?">
         <sipProfile>
            <name>DSN Namespace</name>
            <description>SIP DSN Namespace Profile</description>
            <resourcePriorityNamespaceListName uuid="?">dsn</resourcePriorityNamespaceListName>
            <enableAnatForEarlyOfferCalls>false</enableAnatForEarlyOfferCalls>
            <rsvpOverSip>Local RSVP</rsvpOverSip>
            <fallbackToLocalRsvp>true</fallbackToLocalRsvp>
            <sipRe11XxEnabled>Send PRACK if 1xx Contains SDP</sipRe11XxEnabled>
            <allowMultipleCodecs>false</allowMultipleCodecs>
            <sipSessionRefreshMethod>Invite</sipSessionRefreshMethod>
            <earlyOfferSuppVoiceCall>Mandatory (insert MTP if needed)</earlyOfferSuppVoiceCall>
            <cucmVersionInSipHeader>Major And Minor</cucmVersionInSipHeader>
            <confidentialAccessLevelHeaders>Disabled</confidentialAccessLevelHeaders>
            <inactiveSDPRequired>false</inactiveSDPRequired>
         </sipProfile>
      </ns:addSipProfile>
   </soapenv:Body>
</soapenv:Envelope>

